{
  "format": "layers-model",
  "generatedBy": "keras v3.3.3",
  "convertedBy": "TensorFlow.js Converter v4.18.0",
  "modelTopology": {
    "keras_version": "3.3.3",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "dtype": "float32",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 1],
              "inputShape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 1]
      }
    },
    "training_config": {
      "loss": "mean_squared_error",
      "loss_weights": null,
      "metrics": null,
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": true,
      "optimizer_config": {
        "class_name": "SGD",
        "config": {
          "name": "SGD",
          "learning_rate": 0.009999999776482582,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "momentum": 0.0,
          "nesterov": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "sequential/dense/kernel",
          "shape": [1, 1],
          "dtype": "float32"
        },
        { "name": "sequential/dense/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
